posts/textbooks/index.org
#+BEGIN_COMMENT
.. title: 教科書
.. slug: textbooks
.. date: 2017-09-03 14:18:21 UTC+09:00
.. tags: 本
.. category:
.. link:
.. description:
.. type: text
#+END_COMMENT

講義で使った教科書のリスト。

{{{TEASER_END}}}

読みきった本は読書メーターで管理しているが、講義で使う教科書は途中で終わることが多いので読書メーターで管理しきれない。そこでここにまとめた。

「あの講義で使ったあの本の名前、何だっけ?」というときのためにリストしてある。講義で教科書・参考書として指定されていなくても講義が無かったら読まなかっただろう本も載せた。

* ハードウェア実験
  - 小林 優 (2016), [[http://www.shuwasystem.co.jp/products/7980html/4753.html][FPGAプログラミング大全 Xilinx編]], 秀和システム

* 計算機構成論
  - 坂井 修一 (2004), [[http://www.coronasha.co.jp/np/isbn/9784339018431/][電子情報通信レクチャーシリーズ コンピュータアーキテクチャ]], コロナ社
  - デイビッド・A・パターソン, ジョン・Ｌ・ヘネシー 著, 成田 光彰 訳 (2014), [[http://bpstore.nikkeibp.co.jp/item/books/P98420.html][コンピュータの構成と設計 第5版]], 日経BP

* 言語処理系論 (演習を含む)
  - Andrew W. Appel (1997), [[http://www.cambridge.org/jp/academic/subjects/computer-science/programming-languages-and-applied-logic/modern-compiler-implementation-ml][Modern compiler implementation in ML]], Cambridge University Press
  - Leon Sterling, E.Y.Shapiro 著, 松田 利夫 訳 (1988), [[http://www.kyoritsu-pub.co.jp/bookdetail/9784320097100][Prologの技芸]], 共立出版

* 情報論理
  - 西崎 真也, 萩谷 昌己, (2007), [[https://www.iwanami.co.jp/book/b265606.html][論理と計算のしくみ]], 岩波書店
  - 小野 寛晰 (1994), [[https://www.nippyo.co.jp/shop/book/1292.html][情報科学における論理]], 日本評論社

* 離散数学
  - Reinhard Diestel (2016), [[http://www.springer.com/jp/book/9783662536216][Graph Theory 5th edition]], Springer
  - R. J.ウィルソン 著, 西関 隆夫, 西関 裕子 共訳 (2001), [[http://www.kindaikagaku.co.jp/information/kd0296.htm][グラフ理論入門]], 近代科学社
  - 今野 浩 (1987), [[https://www.amazon.co.jp/%E7%B7%9A%E5%BD%A2%E8%A8%88%E7%94%BB%E6%B3%95-%E4%BB%8A%E9%87%8E-%E6%B5%A9/dp/4817150149][線形計画法]], 日科技連出版社
  - 今野 浩 (2014), [[https://www.iwanami.co.jp/book/b263057.html][ヒラノ教授の線形計画法物語]], 岩波書店

* オペレーティングシステム (演習を含む)
  - Greg Gagne, Abraham Silberschatz, Peter B. Galvin (2008), [[http://as.wiley.com/WileyCDA/WileyTitle/productCd-1118093755.html][Operating System Concepts, 9th Edition]], John Wiley & Sons Ltd; International student
  - Stephen A. Rago, W. Richard Stevens 訳, 大木 敦雄 監訳 (2014), [[http://www.shoeisha.co.jp/book/detail/9784798135021][詳解UNIXプログラミング 第3版]], 翔泳社

* 生物情報学論
  - なし

* 情報科学実験
  - 柴田 望洋 (2014), [[http://www.sbcr.jp/products/4797377026.html][新・明解C言語 入門編]], SBクリエイティブ
  - 柴田 望洋 (2015), [[http://www.sbcr.jp/products/4797384109.html][新・明解C言語 実践編]], SBクリエイティブ

* 集合と位相
  - 内田 伏一 (1986), [[https://www.shokabo.co.jp/mybooks/ISBN978-4-7853-1401-9.htm][集合と位相]], 裳華房
  - 一樂 重雄 (2008), [[https://www.nippyo.co.jp/shop/book/4084.html][意味がわかる位相空間論]], 日本評論社
  - 篠田寿一 米澤佳己 (1995), [[http://www.saiensu.co.jp/?page%3Dbook_details&ISBN%3DISBN4-7819-0772-5][集合・位相演習]] , サイエンス社
  - 森 毅 (2006), [[http://www.chikumashobo.co.jp/product/9784480089571/][位相のこころ]], 筑摩書房

* ハードウェア構成法
  - 小林 芳直 (1998), [[http://www.cqpub.co.jp/hanbai/books/30/30441.htm][定本 ASICの論理回路設計]], CQ出版社

* 計算機システム
  - デイビッド・A・パターソン, ジョン・Ｌ・ヘネシー 著, 成田 光彰 訳 (2014), [[http://bpstore.nikkeibp.co.jp/item/books/P98420.html][コンピュータの構成と設計 第5版]], 日経BP

* 形式言語理論
  - 配布された教科書
  - Michael Sipser 著, 太田 和夫, 田中 圭介 監訳 (2008), [[http://www.kyoritsu-pub.co.jp/bookdetail/9784320122079][計算理論の基礎 原著第2版]], 共立出版

* アルゴリズムとデータ構造
  - 五十嵐健夫 (2007), [[http://www.saiensu.co.jp/?page%3Dbook_details&ISBN%3DISBN978-4-901683-49-4][データ構造とアルゴリズム]], サイエンス社

* 情報数学
  - 横尾 英俊 (2004), [[http://www.kyoritsu-pub.co.jp/kenpon/bookDetail/9784320121065][情報理論の基礎]], 共立出版
  - 徳山 豪 (2003), [[http://www.saiensu.co.jp/?page%3Dbook_details&ISBN%3DISBN4-901683-10-1][離散数学とその応用]], サイエンス社

* 統計物理学
  - 田崎 晴明 (2008),  [[http://www.gakushuin.ac.jp/~881791/statbook/][統計力学 Ⅰ・Ⅱ]], 培風館

* 生命科学
  - 東京大学生命科学教科書編集委員会 (2016), [[https://www.yodosha.co.jp/yodobook/book/9784758120678/][演習で学ぶ生命科学]], 羊土社

* 物性化学
  - 小川 桂一郎 / 小島 憲道 (2010), [[http://www.kspub.co.jp/book/detail/1543690.html][新版 現代物性化学の基礎 ―化学結合論によるアプローチ―]], 講談社

* 現代生命科学
  - 東京大学生命科学教科書編集委員会 (2015), [[https://www.yodosha.co.jp/yodobook/book/9784758120531/][現代生命科学]], 羊土社

* 記号論理学
  - Michael Sipser (2008), [[http://www.kyoritsu-pub.co.jp/bookdetail/9784320122079][計算理論の基礎 原著第2版]], 共立出版
  - 田中 一之 (2006), [[http://www.utp.or.jp/book/b297559.html][ゲーデルと20世紀の論理学]], 東京大学出版会
  - Piergiorgio Odifreddi (1992), [[https://www.elsevier.com/books/classical-recursion-theory/odifreddi/978-0-444-89483-0][Classical Recursion Theory]], North-Holland
  - 菊池誠 (2014), [[http://www.kyoritsu-pub.co.jp/bookdetail/9784320110960][不完全性定理]], 共立出版

* アルゴリズム入門
  - 増原 英彦 (2010), [[http://prg.is.titech.ac.jp/i2cs.rb/][情報科学入門 Rubyを使って学ぶ]], 東京大学情報教育連絡会

* 電磁気学
  - 狩野 覚 市村 宗武 (2012), [[http://www.tkd-pbl.com/book/b16204.html][物理学入門 II. 電磁気学]],  株式会社東京化学同人

* 構造化学
  - 東京大学教養学部化学部会 (2003), [[http://www.utp.or.jp/book/b302176.html][化学の基礎77講]], 東京大学出版会

* 図形科学
  - 鈴木 賢次郎, 横山 ゆりか, 金井 崇 (2012), [[http://www.saiensu.co.jp/?page%3Dbook_details&ISBN%3DISBN978-4-7819-1301-8&YEAR%3D2012][3D-CAD/CG入門 第2版]], サイエンス社

* 基礎統計
  - 倉田博史, 星野崇宏 (2009), [[http://www.saiensu.co.jp/?page=book_details&ISBN=978-4-88384-140-0][入門統計解析]],  サイエンス社

* 情報
  - 山口 和紀 (2006), [[http://www.utp.or.jp/book/b307403.html][情報]], 東京大学出版会 (リンクは2版)

* 力学
  - 今井 功, 高見 穎郎, 高木 隆司, 吉澤 徴, 下村 裕 (2006), [[http://www.saiensu.co.jp/?page=book_details&ISBN=ISBN4-7819-1138-2][演習力学 新訂版]], サイエンス社

* 熱力学
  - 佐々 真一 (2000), [[http://www.kyoritsu-pub.co.jp/kenpon/bookDetail/9784320033474][熱力学入門]], 共立出版

* 微積分学
  - 斎藤 毅 (2013), [[http://www.utp.or.jp/book/b306590.html][微積分]], 東京大学出版会

* 線形代数学
  - 斎藤 正彦 (1966), [[http://www.utp.or.jp/book/b302039.html][線型代数入門]], 東京大学出版会
