posts/textbooks/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="ja">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>教科書 | iiyuki's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://yuki67.github.io/posts/textbooks/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="iiyuki">
<meta property="og:site_name" content="iiyuki's blog">
<meta property="og:title" content="教科書">
<meta property="og:url" content="https://yuki67.github.io/posts/textbooks/">
<meta property="og:description" content="講義で使った教科書のリスト。





読みきった本は読書メーターで管理しているが、講義で使う教科書は途中で終わることが多いので読書メーターで管理しきれない。そこでここにまとめた。



「あの講義で使ったあの本の名前、何だっけ?」というときのためにリストしてある。講義で教科書・参考書として指定されていなくても講義が無かったら読まなかっただろう本も載せた。



ハードウェア実験


小林 優 (">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-09-03T14:18:21+09:00">
<meta property="article:tag" content="本">
</head>
<body>
    <!-- Global Site Tag (gtag.js) - Google Analytics -->
    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-107335237-1"></script><script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments)};
    gtag('js', new Date());

    gtag('config', 'UA-107335237-1');
    </script><section class="social"><ul>
<li><a href="https://yuki67.github.io/index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="../../https://yuki67.github.io/archive.html" title="Archives"><i class="icon-folder-open-alt"></i></a></li>
            <li><a href="https://yuki67.github.io/categories/index.html" title="Tags"><i class="icon-tags"></i></a></li>
            <li><a href="https://yuki67.github.io/rss.xml" title="RSS"><i class="icon-rss"></i></a></li>
            <li><a href="https://yuki67.github.io/pages/about/" title="About me"><i class="icon-user"></i></a></li>
            <li><a href="https://twitter.com/" title="My Twitter"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/yuki67" title="My Github"><i class="icon-github"></i></a></li>

        </ul></section><section class="page-content"><div class="content" rel="main">
            
    <div class="post">
    
    <h1 class="p-name entry-title" itemprop="headline name">教科書</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2017-09-03T14:18:21+09:00">2017-09-03 14:18</time>
            

            
          |  
        <a href="index.org" id="sourcelink">ソース</a>

            </div>
            
        <div itemprop="keywords" class="tags">
        <ul>
        タグ : 
           <li><a class="tag p-category" href="../../categories/ben/" rel="tag">本</a></li>
        </ul>
</div>

        </div>
        <div class="body">
            <p>
講義で使った教科書のリスト。
</p>

<!-- TEASER_END -->

<p>
読みきった本は読書メーターで管理しているが、講義で使う教科書は途中で終わることが多いので読書メーターで管理しきれない。そこでここにまとめた。
</p>

<p>
「あの講義で使ったあの本の名前、何だっけ?」というときのためにリストしてある。講義で教科書・参考書として指定されていなくても講義が無かったら読まなかっただろう本も載せた。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">ハードウェア実験</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>小林 優 (2016), <a href="http://www.shuwasystem.co.jp/products/7980html/4753.html">FPGAプログラミング大全 Xilinx編</a>, 秀和システム
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">計算機構成論</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>坂井 修一 (2004), <a href="http://www.coronasha.co.jp/np/isbn/9784339018431/">電子情報通信レクチャーシリーズ コンピュータアーキテクチャ</a>, コロナ社
</li>
<li>デイビッド・A・パターソン, ジョン・Ｌ・ヘネシー 著, 成田 光彰 訳 (2014), <a href="http://bpstore.nikkeibp.co.jp/item/books/P98420.html">コンピュータの構成と設計 第5版</a>, 日経BP
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">言語処理系論 (演習を含む)</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Andrew W. Appel (1997), <a href="http://www.cambridge.org/jp/academic/subjects/computer-science/programming-languages-and-applied-logic/modern-compiler-implementation-ml">Modern compiler implementation in ML</a>, Cambridge University Press
</li>
<li>Leon Sterling, E.Y.Shapiro 著, 松田 利夫 訳 (1988), <a href="http://www.kyoritsu-pub.co.jp/bookdetail/9784320097100">Prologの技芸</a>, 共立出版
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">情報論理</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>西崎 真也, 萩谷 昌己, (2007), <a href="https://www.iwanami.co.jp/book/b265606.html">論理と計算のしくみ</a>, 岩波書店
</li>
<li>小野 寛晰 (1994), <a href="https://www.nippyo.co.jp/shop/book/1292.html">情報科学における論理</a>, 日本評論社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">離散数学</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Reinhard Diestel (2016), <a href="http://www.springer.com/jp/book/9783662536216">Graph Theory 5th edition</a>, Springer
</li>
<li>R. J.ウィルソン 著, 西関 隆夫, 西関 裕子 共訳 (2001), <a href="http://www.kindaikagaku.co.jp/information/kd0296.htm">グラフ理論入門</a>, 近代科学社
</li>
<li>今野 浩 (1987), <a href="https://www.amazon.co.jp/%E7%B7%9A%E5%BD%A2%E8%A8%88%E7%94%BB%E6%B3%95-%E4%BB%8A%E9%87%8E-%E6%B5%A9/dp/4817150149">線形計画法</a>, 日科技連出版社
</li>
<li>今野 浩 (2014), <a href="https://www.iwanami.co.jp/book/b263057.html">ヒラノ教授の線形計画法物語</a>, 岩波書店
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">オペレーティングシステム (演習を含む)</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Greg Gagne, Abraham Silberschatz, Peter B. Galvin (2008), <a href="http://as.wiley.com/WileyCDA/WileyTitle/productCd-1118093755.html">Operating System Concepts, 9th Edition</a>, John Wiley &amp; Sons Ltd; International student
</li>
<li>Stephen A. Rago, W. Richard Stevens 訳, 大木 敦雄 監訳 (2014), <a href="http://www.shoeisha.co.jp/book/detail/9784798135021">詳解UNIXプログラミング 第3版</a>, 翔泳社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">生物情報学論</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>なし
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">情報科学実験</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>柴田 望洋 (2014), <a href="http://www.sbcr.jp/products/4797377026.html">新・明解C言語 入門編</a>, SBクリエイティブ
</li>
<li>柴田 望洋 (2015), <a href="http://www.sbcr.jp/products/4797384109.html">新・明解C言語 実践編</a>, SBクリエイティブ
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">集合と位相</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>内田 伏一 (1986), <a href="https://www.shokabo.co.jp/mybooks/ISBN978-4-7853-1401-9.htm">集合と位相</a>, 裳華房
</li>
<li>一樂 重雄 (2008), <a href="https://www.nippyo.co.jp/shop/book/4084.html">意味がわかる位相空間論</a>, 日本評論社
</li>
<li>篠田寿一 米澤佳己 (1995), <a href="http://www.saiensu.co.jp/?page=book_details&amp;ISBN=ISBN4-7819-0772-5">集合・位相演習</a> , サイエンス社
</li>
<li>森 毅 (2006), <a href="http://www.chikumashobo.co.jp/product/9784480089571/">位相のこころ</a>, 筑摩書房
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">ハードウェア構成法</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>小林 芳直 (1998), <a href="http://www.cqpub.co.jp/hanbai/books/30/30441.htm">定本 ASICの論理回路設計</a>, CQ出版社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">計算機システム</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>デイビッド・A・パターソン, ジョン・Ｌ・ヘネシー 著, 成田 光彰 訳 (2014), <a href="http://bpstore.nikkeibp.co.jp/item/books/P98420.html">コンピュータの構成と設計 第5版</a>, 日経BP
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">形式言語理論</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>配布された教科書
</li>
<li>Michael Sipser 著, 太田 和夫, 田中 圭介 監訳 (2008), <a href="http://www.kyoritsu-pub.co.jp/bookdetail/9784320122079">計算理論の基礎 原著第2版</a>, 共立出版
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">アルゴリズムとデータ構造</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>五十嵐健夫 (2007), <a href="http://www.saiensu.co.jp/?page=book_details&amp;ISBN=ISBN978-4-901683-49-4">データ構造とアルゴリズム</a>, サイエンス社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">情報数学</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>横尾 英俊 (2004), <a href="http://www.kyoritsu-pub.co.jp/kenpon/bookDetail/9784320121065">情報理論の基礎</a>, 共立出版
</li>
<li>徳山 豪 (2003), <a href="http://www.saiensu.co.jp/?page=book_details&amp;ISBN=ISBN4-901683-10-1">離散数学とその応用</a>, サイエンス社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">統計物理学</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>田崎 晴明 (2008),  <a href="http://www.gakushuin.ac.jp/~881791/statbook/">統計力学 Ⅰ・Ⅱ</a>, 培風館
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">生命科学</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>東京大学生命科学教科書編集委員会 (2016), <a href="https://www.yodosha.co.jp/yodobook/book/9784758120678/">演習で学ぶ生命科学</a>, 羊土社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">物性化学</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>小川 桂一郎 / 小島 憲道 (2010), <a href="http://www.kspub.co.jp/book/detail/1543690.html">新版 現代物性化学の基礎 ―化学結合論によるアプローチ―</a>, 講談社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">現代生命科学</h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li>東京大学生命科学教科書編集委員会 (2015), <a href="https://www.yodosha.co.jp/yodobook/book/9784758120531/">現代生命科学</a>, 羊土社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">記号論理学</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>Michael Sipser (2008), <a href="http://www.kyoritsu-pub.co.jp/bookdetail/9784320122079">計算理論の基礎 原著第2版</a>, 共立出版
</li>
<li>田中 一之 (2006), <a href="http://www.utp.or.jp/book/b297559.html">ゲーデルと20世紀の論理学</a>, 東京大学出版会
</li>
<li>Piergiorgio Odifreddi (1992), <a href="https://www.elsevier.com/books/classical-recursion-theory/odifreddi/978-0-444-89483-0">Classical Recursion Theory</a>, North-Holland
</li>
<li>菊池誠 (2014), <a href="http://www.kyoritsu-pub.co.jp/bookdetail/9784320110960">不完全性定理</a>, 共立出版
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20">アルゴリズム入門</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>増原 英彦 (2010), <a href="http://prg.is.titech.ac.jp/i2cs.rb/">情報科学入門 Rubyを使って学ぶ</a>, 東京大学情報教育連絡会
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21">電磁気学</h2>
<div class="outline-text-2" id="text-21">
<ul class="org-ul">
<li>狩野 覚 市村 宗武 (2012), <a href="http://www.tkd-pbl.com/book/b16204.html">物理学入門 II. 電磁気学</a>,  株式会社東京化学同人
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22">構造化学</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li>東京大学教養学部化学部会 (2003), <a href="http://www.utp.or.jp/book/b302176.html">化学の基礎77講</a>, 東京大学出版会
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23">図形科学</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li>鈴木 賢次郎, 横山 ゆりか, 金井 崇 (2012), <a href="http://www.saiensu.co.jp/?page=book_details&amp;ISBN=ISBN978-4-7819-1301-8&amp;YEAR=2012">3D-CAD/CG入門 第2版</a>, サイエンス社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24">基礎統計</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>倉田博史, 星野崇宏 (2009), <a href="http://www.saiensu.co.jp/?page=book_details&amp;ISBN=978-4-88384-140-0">入門統計解析</a>,  サイエンス社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25">情報</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>山口 和紀 (2006), <a href="http://www.utp.or.jp/book/b307403.html">情報</a>, 東京大学出版会 (リンクは2版)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26">力学</h2>
<div class="outline-text-2" id="text-26">
<ul class="org-ul">
<li>今井 功, 高見 穎郎, 高木 隆司, 吉澤 徴, 下村 裕 (2006), <a href="http://www.saiensu.co.jp/?page=book_details&amp;ISBN=ISBN4-7819-1138-2">演習力学 新訂版</a>, サイエンス社
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27">熱力学</h2>
<div class="outline-text-2" id="text-27">
<ul class="org-ul">
<li>佐々 真一 (2000), <a href="http://www.kyoritsu-pub.co.jp/kenpon/bookDetail/9784320033474">熱力学入門</a>, 共立出版
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28">微積分学</h2>
<div class="outline-text-2" id="text-28">
<ul class="org-ul">
<li>斎藤 毅 (2013), <a href="http://www.utp.or.jp/book/b306590.html">微積分</a>, 東京大学出版会
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29">線形代数学</h2>
<div class="outline-text-2" id="text-29">
<ul class="org-ul">
<li>斎藤 正彦 (1966), <a href="http://www.utp.or.jp/book/b302039.html">線型代数入門</a>, 東京大学出版会
</li>
</ul>
</div>
</div>
        </div>
        
        <ul class="pager hidden-print">
<li class="previous">
                <a href="../random_pick/" rel="prev" title="ランダムピック">一つ前の文書</a>
            </li>
            <li class="next">
                <a href="../perl-oneliner/" rel="next" title="perlのワンライナー">次の文書</a>
            </li>
        </ul>
</div>



             
        <footer id="footer"><p>Contents © 2017         <a href="mailto:123syokutaku@gmail.com">iiyuki</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script><script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
</body>
</html>
